In [7]:
import pandas as pd 
sal_d=pd.read_csv("D:/Phython/DAY1/basic_salary.csv")

In [12]:
sal_d.describe()

                 ba            ms
count     12.000000     11.000000
mean   16154.583333  11004.545455
std     3739.378569   3711.189469
min    11960.000000   6630.000000
25%    13472.500000   7360.000000
50%    14270.000000  10760.000000
75%    19238.750000  14225.000000
max    23280.000000  16070.000000

In [13]:
sal_d.describe

<bound method NDFrame.describe of    First_Name Last_Name Grade Location     ba       ms
0        Alan     Brown   GR1    DELHI  17990  16070.0
1      Agatha  Williams   GR2   MUMBAI  12390   6630.0
2      Rajesh     Kolte   GR1   MUMBAI  19250  14960.0
3       Ameet    Mishra   GR2    DELHI  14780   9300.0
4        Neha       Rao   GR1   MUMBAI  19235  15200.0
5       Sagar    Chavan   GR2   MUMBAI  13390   6700.0
6       Aaron     Jones   GR1   MUMBAI  23280  13490.0
7        John     Patil   GR2   MUMBAI  13500  10760.0
8       Sneha     Joshi   GR1    DELHI  20660      NaN
9      Gaurav     Singh   GR2    DELHI  13760  13220.0
10      Adela    Thomas   GR2    DELHI  13660   6840.0
11       Anup      Save   GR2   MUMBAI  11960   7880.0>

In [9]:
sal_d.head(5)

  First_Name Last_Name Grade Location     ba       ms
0       Alan     Brown   GR1    DELHI  17990  16070.0
1     Agatha  Williams   GR2   MUMBAI  12390   6630.0
2     Rajesh     Kolte   GR1   MUMBAI  19250  14960.0
3      Ameet    Mishra   GR2    DELHI  14780   9300.0
4       Neha       Rao   GR1   MUMBAI  19235  15200.0

In [10]:
sal_d.columns

Index(['First_Name', 'Last_Name', 'Grade', 'Location', 'ba', 'ms'], dtype='object')

In [11]:
sal_d.std()

C:\Users\rahul\AppData\Local\Temp/ipykernel_6112/2152159082.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  sal_d.std()

ba    3739.378569
ms    3711.189469
dtype: float64

In [16]:
mean_data=sal_d[0:4]
mean_data

  First_Name Last_Name Grade Location     ba       ms
0       Alan     Brown   GR1    DELHI  17990  16070.0
1     Agatha  Williams   GR2   MUMBAI  12390   6630.0
2     Rajesh     Kolte   GR1   MUMBAI  19250  14960.0
3      Ameet    Mishra   GR2    DELHI  14780   9300.0

In [17]:
sal_d.Location.value_counts()

MUMBAI    7
DELHI     5
Name: Location, dtype: int64